[{"data":1,"prerenderedAt":150},["Reactive",2],{"content-query-1Akxwulqc8":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"basics":7,"work":16,"education":93,"skills":97,"interests":134,"_id":146,"_type":147,"title":5,"_source":148,"_file":149,"_extension":147},"/resume","",false,{"name":8,"label":9,"summary":10,"email":11,"phone":12,"location":13},"Andrew Campbell","Full Stack Developer","A seasoned full-stack engineer, I excel in unraveling complex challenges and crafting solutions that seamlessly blend with user needs. I believe in speaking the language of users, be it in UX interfaces or APIs. I design tools to handle the mundane, freeing users to focus on their expertise.","popwrangler@mac.com","413.687.4796",{"city":14,"region":15},"Amherst","MA",[17,49,58,65,72,80,86],{"name":18,"position":19,"startDate":20,"endDate":21,"summary":22,"projects":23},"Menujax","Co-Founder, Lead Programmer and Designer",2012,2023,"At Menujax, I led the OrdrUs and Menuabl projects as a full-stack developer, creating low-maintenance, reliable systems. Operational efficiency and flexible codebases were key to enabling rapid development and the ability to respond to customer feedback and market shifts. Collaborating closely with customers and domain experts, I honed my skill of translating user challenges into innovative solutions.",[24,38],{"name":25,"summary":26,"tags":27,"highlights":33},"OrdrUs","OrdrUs brings in-person hospitality to your phone, enhancing online ordering with unique, engaging interactions that foster customer loyalty.",[28,29,30,31,32],"Rails","Redis","Mixpanel","PubSub","Twilio/Sendgrid",[34,35,36,37],"Engineered a responsive, user-friendly ordering system using Backbone.js, optimized for diverse devices and network speeds.","Designed and managed core infrastructure with Rails, Postgres, and Heroku.","Innovated SMS-based pickup and curbside delivery systems (pre-covid), integrating email (SendGrid), SMS, and telephony (Twilio) for enhanced customer communication and order management.","Created comprehensive customer and restaurant management systems, enhancing operational efficiency and user satisfaction.",{"name":39,"summary":40,"tags":41,"highlights":46},"Menuabl","Menuabl offers restaurants a way to reconnect with their customers in an age of intermediation, providing tools to share menus, specials, and promotions directly in a beautiful and richly branded way.",[42,43,44,45],"GraphQL","Vue","Netlify","Hasura",[47,48],"Designed and implemented a Vue powered visual editor for the rapid creation and deployment of print-worthy menus and promotions significantly reducing customer acquistion time and costs.","Leveraged Hasura as the central hub for our low-code backend, effectively coordinating GraphQL for data access, Auth0 integration for authentication, and Express for business logic.",{"name":50,"position":51,"startDate":52,"endDate":53,"highlights":54},"Freelance Web Developer","Web Developer and Designer","2005","2012",[55,56,57],"Engaged in web development and site design for local businesses utilizing PHP, Yii, Drupal, HTML/CSS and Javascript.","Collaborated with clients to translate their visions into web designs.","Developed a client-facing site management portal in Yii.",{"name":59,"position":60,"startDate":61,"endDate":20,"highlights":62},"One Bit Games","Founder, Developer and Artist",2000,[63,64],"Designed and developed, Pop-Pop a head-to-head action puzzle game, Breakout meets Dr. Mario. Published by Ambrosia Sofware. Inducted into the MacWorld Game Hall of Fame. Written in C++.","Turnstile. Designed and developed Turnstile, an action word puzzle game with a train and travel theme. Written in Python and C.",{"name":66,"position":67,"startDate":61,"endDate":68,"highlights":69},"Amaze Entertainment","Lead Mac Engineer, OpenGL Engineer",2003,[70,71],"Created the Mac port of Finding Nemo Adventure and Finding Nemoe's Underwater World of Fun.","Optimized companies graphics engine, doubling fps, by identifying bottlenecks and inefficiencies in STL use and rewriting code in pure C and with better cache awareness.",{"name":73,"position":74,"startDate":75,"endDate":61,"highlights":76},"Ultra-United","Co-Founder and Lead Developer",1996,[77,78,79],"Designed and developed Battle-Girl, an award-winning vector-graphics dual-stick style shooter, a mashup of Robotron, Sinistar and Defender.","Wrote core game engine in C and PowerPC assembly.","Developed arcade port of Battle-Girl in partnership with PlayPak Systems.",{"name":81,"position":82,"startDate":83,"endDate":75,"highlights":84},"MacXperts / Brand X","Senior Programmer",1994,[85],"Lead Programner for TabulaRasa Server and Designer products. TabulaRasa was a interactive forms system with a Apple Newton client and Macintosh based server and form designer. The Macintosh apps were written in C++ and MacApp.",{"name":87,"position":88,"startDate":89,"endDate":83,"highlights":90},"Diehl Graphsoft","Software Engineer",1993,[91,92],"Developed the framework for plugin authoring","Designed and built visual interface designer to allow creation of targeted uis for vertical markets.",[94],{"studyType":95,"institution":96},"B.A. Computer Science","Vassar College",[98,105,113,118,127],{"name":99,"keywords":100},"Languages",[101,102,103,104],"Javascript","Typescript","Ruby","Python",{"name":106,"keywords":107,"level":112},"Frontend",[43,108,109,110,111],"GraphQL/Apollo","HTML","CSS/SCSS","Tailwind","Senior",{"name":114,"keywords":115,"level":112},"Backend",[45,116,117,28],"Postgres","Node/Express",{"name":119,"keywords":120},"Services",[121,122,44,123,124,125,126],"Docker","Heroku","Auth0","AWS","Twilio","SendGrid",{"name":128,"keywords":129},"Art",[130,131,132,133],"Oil","Watercolor","Fountain Pen","Paper Sculpture",[135,139],{"name":136,"keywords":137},"Painting",[130,138,131],"Acrylic",{"name":140,"keywords":141},"Illustration",[142,143,144,145],"Pen & Ink","Procreate","Illustrator","Affinity Designer","content:resume:index.yaml","yaml","content","resume/index.yaml",1710291304690]